
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"f6d46937e8898a6ff2a0977e0b9a40965a451f2c962ec87fb65a364725dfe19c\"" -> "W/\"7eabd442ce4af7ac65f5e42a99f09ab2d9dd2f6550111bcfe5f7b3dd6d6fe249\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"9965fe7e98f38e8c957dca257d71fae1a939494c82b7d5a4c57ab74f5029cd82\"" -> "W/\"b95036003c146d010fcaafd2e7077d7f4c1b5b1f4d173c28e1da1e41b20f65c9\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"27c6c2194021c4bf491f0b0b3f1b930d388f1f9ae38865e7577cbe7f078c31d2\"" -> "W/\"3352435362255f4b7fac3e54a2a3be2da92128d3364b0559160ddd8a09938c8e\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"d31e566bbf3093f10a1aa379a0fe0829dd4bafd88850da728b3ab9b9fe4054d1\"" -> "W/\"3d271c91dac4ffa508fa181d9b7924ca032cb14aa5d7d99ae07f3e3d7d5d37de\""
        id                          = "template-template"
        name                        = "template-template"
        # (29 unchanged attributes hidden)
    }

  # local_file.hello_world has been deleted
  - resource "local_file" "hello_world" {
      - content              = "Hello, World!" -> null
      - content_base64sha256 = "3/1gIbsr1bCvZ2KQgJ7DpTGR3YHH9wpLKGiKNiGCmG8=" -> null
      - content_base64sha512 = "N015SpXNz9izWZMYX++bo2jxYNja9DLQi6nx7R5avmzGkpHg+i/gAGpSVw7xjBne9OYXwzzlLvCm5fvjGMsDhw==" -> null
      - content_md5          = "65a8e27d8879283831b664bd8b7f0ad4" -> null
      - content_sha1         = "0a0a9f2a6772942557ab5355d76af442f8f65e01" -> null
      - content_sha256       = "dffd6021bb2bd5b0af676290809ec3a53191dd81c7f70a4b28688a362182986f" -> null
      - content_sha512       = "374d794a95cdcfd8b35993185fef9ba368f160d8daf432d08ba9f1ed1e5abe6cc69291e0fa2fe0006a52570ef18c19def4e617c33ce52ef0a6e5fbe318cb0387" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./hello_world.txt" -> null
      - id                   = "0a0a9f2a6772942557ab5355d76af442f8f65e01" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository.settings_all["kong-development"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"7eabd442ce4af7ac65f5e42a99f09ab2d9dd2f6550111bcfe5f7b3dd6d6fe249\"" -> null
      - full_name                   = "gh-org-template/kong-development" -> null
      - git_clone_url               = "git://github.com/gh-org-template/kong-development.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/kong-development" -> null
      - http_clone_url              = "https://github.com/gh-org-template/kong-development.git" -> null
      - id                          = "kong-development" -> null
      - is_template                 = false -> null
      - name                        = "kong-development" -> null
      - node_id                     = "R_kgDOMkD9FQ" -> null
      - primary_language            = "Shell" -> null
      - private                     = false -> null
      - repo_id                     = 843119893 -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/kong-development.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/kong-development" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-1-github-release" -> null
        }
    }

  # github_repository.settings_all["kong-openssl"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"b95036003c146d010fcaafd2e7077d7f4c1b5b1f4d173c28e1da1e41b20f65c9\"" -> null
      - full_name                   = "gh-org-template/kong-openssl" -> null
      - git_clone_url               = "git://github.com/gh-org-template/kong-openssl.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/kong-openssl" -> null
      - http_clone_url              = "https://github.com/gh-org-template/kong-openssl.git" -> null
      - id                          = "kong-openssl" -> null
      - is_template                 = false -> null
      - name                        = "kong-openssl" -> null
      - node_id                     = "R_kgDOMkeCGA" -> null
      - primary_language            = "Shell" -> null
      - private                     = false -> null
      - repo_id                     = 843547160 -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/kong-openssl.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/kong-openssl" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-1-github-release" -> null
        }
    }

  # github_repository.settings_all["kong-runtime"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"3352435362255f4b7fac3e54a2a3be2da92128d3364b0559160ddd8a09938c8e\"" -> null
      - full_name                   = "gh-org-template/kong-runtime" -> null
      - git_clone_url               = "git://github.com/gh-org-template/kong-runtime.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/kong-runtime" -> null
      - http_clone_url              = "https://github.com/gh-org-template/kong-runtime.git" -> null
      - id                          = "kong-runtime" -> null
      - is_template                 = false -> null
      - name                        = "kong-runtime" -> null
      - node_id                     = "R_kgDOMkeCAw" -> null
      - primary_language            = "Shell" -> null
      - private                     = false -> null
      - repo_id                     = 843547139 -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/kong-runtime.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/kong-runtime" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-1-github-release" -> null
        }
    }

  # github_repository.settings_all["template-template"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"3d271c91dac4ffa508fa181d9b7924ca032cb14aa5d7d99ae07f3e3d7d5d37de\"" -> null
      - full_name                   = "gh-org-template/template-template" -> null
      - git_clone_url               = "git://github.com/gh-org-template/template-template.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/template-template" -> null
      - http_clone_url              = "https://github.com/gh-org-template/template-template.git" -> null
      - id                          = "template-template" -> null
      - is_template                 = true -> null
      - name                        = "template-template" -> null
      - node_id                     = "R_kgDOMkeCEQ" -> null
      - primary_language            = "Makefile" -> null
      - private                     = false -> null
      - repo_id                     = 843547153 -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/template-template.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/template-template" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null
    }

  # local_file.hello_world will be created
  + resource "local_file" "hello_world" {
      + content              = "Hello, World!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./hello_world.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 4 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->